 let handler  = async (m, { conn, usedPrefix: _p }) => {
let info = `
     *ʜᴀʟɪᴍᴀ-ʙᴏᴛ ×፝֟͜×* *4️⃣0️⃣4️⃣* *ʜᴀʟɪᴍᴀ ʙᴏᴛ ×፝֟͜×* 
*🔥ᎢᏋᎡᎤᎡ🔥Ꮤ𝐇ᎪᎢᎦᎪᏢᏢ🔥* https://youtube.com/@poisonmods
*ʙʏ ᴀʙᴅᴜʟ ×፝֟͜×* ~*۝ŦĦ€ ŁỮĆƗ₣€Ř🕸️⃢🐾
ꫂẉhatsapp.com/๒͖͖͖͖͖͖͖͖͖͖͖͖͖͖͐͐͆͆͆͆͋͢͢͢͢͢ɼ̹̹̹̻̻̻̻̻̻͍͎͎͎͎͎͎͎͍͍͍̾̾͐͐͐͐ѻ͓͓͓͓͓͓͓͓͓͓͓͓͓͓͓͙͙͙͙͙͙͒͛͛͛͛͛͛͛͛͡͡͡͡͡Շ͚͚͚͚͚͚͚͚͚͚͙͙͙͙͙͔͔͔͔͓ͣͣͣͣͣͣͣͣͣͣͣ͗͗͗͗͗͗͗͗͗͗͗͢͢͢͢͢͢͢͝չཽཽཽཽཽཽཽཽཽཽཽཽཽཽﻉ.❾❾.࿋ꫂẉhatsapp.com/↨ࣱ᷂ܶࣧ࣫ࣨࣨؓࣵࣼۢᩴࣱࣱࣲࣦ᷂࣫ࣨࣨࣳࣧ࣫ࣨࣸ࣫ࣥۗۗۢᩴ᮫᮫ࣱࣱࣦܶࣥؓؓؓࣼࣵࣧ࣫ࣨܶؓ↨ࣱ᷂ܶࣧ࣫ࣨࣨؓࣵࣼۢᩴࣱࣱࣲࣦ᷂࣫ࣨࣨࣳࣧ࣫ࣨࣸ࣫ࣥۗۗۢᩴ᮫ࣱࣱࣦܶࣥؓؓؓࣼࣵࣧ࣫ஓீ͜ム̥₣Ʉ₵₭ ₮ⱧɆ ₴Ɏ₴₮Ɇ₥ ⁂͕͢ ȻɣɃ迄Ʀ  ȻɌỉϻℇ.   http://ム🌺खͩᴙͬᴏͦωᷱʑᷦᤇͤʀ●؎ᴏғғɪᴄɪᴀʟ.com*~
`.trim()
m.reply(global.wait)
conn.fakeReply(m.chat, info, '0@s.whatsapp.net', '😈 *sᴜʙ ʏᴛ ᴘᴏɪsᴏɴ-ᴍᴏᴅᴢ ʜᴀʟɪᴍᴀ ×፝֟͜× BOT* 😈', 'status@broadcast')
}
handler.command = /^(sumu)$/i
handler.owner = false
handler.mods = false
handler.premium = true
handler.group = false
handler.private = false

handler.admin = false
handler.botAdmin = false

handler.fail = null

export default handler 
 
